In [1]:
people = {
    'First':['Keshav','Rahul','Rajesh'],
    'Last' :['Sharma','Sharma','Kushwaha'],
    'Email':['Kesh4118@gmail.com','Rahul81.rs@gmail.com','Kush@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    First      Last                 Email
0  Keshav    Sharma    Kesh4118@gmail.com
1   Rahul    Sharma  Rahul81.rs@gmail.com
2  Rajesh  Kushwaha        Kush@gmail.com

In [5]:
df['First']+ " " +df['Last']

0      Keshav Sharma
1       Rahul Sharma
2    Rajesh Kushwaha
dtype: object

In [11]:
df['full_name'] = df['First']+ " " +df['Last']

In [12]:
df

    First      Last                 Email        full_name
0  Keshav    Sharma    Kesh4118@gmail.com    Keshav Sharma
1   Rahul    Sharma  Rahul81.rs@gmail.com     Rahul Sharma
2  Rajesh  Kushwaha        Kush@gmail.com  Rajesh Kushwaha

In [23]:
df.drop(columns=['First','Last'],inplace=True)

In [16]:
df

                  Email        full_name
0    Kesh4118@gmail.com    Keshav Sharma
1  Rahul81.rs@gmail.com     Rahul Sharma
2        Kush@gmail.com  Rajesh Kushwaha

In [17]:
df['full_name'].str.split(' ',expand=True)

        0         1
0  Keshav    Sharma
1   Rahul    Sharma
2  Rajesh  Kushwaha

In [24]:
df[['First','Last']] = df['full_name'].str.split(' ',expand=True)

In [26]:
df.drop(columns=['First','Last'],inplace=True)

In [31]:
df

                  Email        full_name   first      last
0    Kesh4118@gmail.com    Keshav Sharma  Keshav    Sharma
1  Rahul81.rs@gmail.com     Rahul Sharma   Rahul    Sharma
2        Kush@gmail.com  Rajesh Kushwaha  Rajesh  Kushwaha

In [38]:
df = df.applymap(str.lower)

In [39]:
df.columns = [x.lower() for x in df.columns]

In [42]:
df

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha

In [44]:
#Row Add
df.append({'first':'Tony','last':'stark'},ignore_index=True)

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha
3                   NaN              NaN    Tony     stark

In [49]:
people = {
    'first':['ravi','shivam'],
    'last' :['sahu','pratap'],
    'email':['rsahu@gmail.com','Rahul81.rs@gmail.com']
}

In [50]:
df2 = pd.DataFrame(people)

In [51]:
df2

    first    last                 email
0    ravi    sahu       rsahu@gmail.com
1  shivam  pratap  Rahul81.rs@gmail.com

In [52]:
df.append(df2,ignore_index=True,sort=False)

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha
3       rsahu@gmail.com              NaN    ravi      sahu
4  Rahul81.rs@gmail.com              NaN  shivam    pratap

In [53]:
df

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha

In [54]:
#But it is not permanent to make parmanent:-

df = df.append(df2,ignore_index=True,sort=False)

In [55]:
df

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha
3       rsahu@gmail.com              NaN    ravi      sahu
4  Rahul81.rs@gmail.com              NaN  shivam    pratap

In [56]:
#Remove row
df.drop(index=3,inplace= True)

In [57]:
df

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha
4  Rahul81.rs@gmail.com              NaN  shivam    pratap

In [58]:
filt = df['last']=='pratap'

In [59]:
df.drop(index=df[filt].index)

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha

In [63]:
df=df.drop(index=df[filt].index)
# Now it's Parmanent

In [64]:
df

                  email        full_name   first      last
0    kesh4118@gmail.com    keshav sharma  keshav    sharma
1  rahul81.rs@gmail.com     rahul sharma   rahul    sharma
2        kush@gmail.com  rajesh kushwaha  rajesh  kushwaha